---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawProfileRoof
source: html/ec0aaf21-10b0-30ea-8437-53c58db8fc84.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawProfileRoof Property

Can't make footprint roof.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawProfileRoof { get; }
```